src/test/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="gen">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCountRequest>
            <gs:numberOfParagraphs>0</gs:numberOfParagraphs>
            <gs:characterToCount>g</gs:characterToCount>
        </gs:getCountRequest>
    </soapenv:Body>
</soapenv:Envelope>